_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
cu_dnnlstm_5 (CuDNNLSTM)     (None, 80)                58240     
_________________________________________________________________
dropout_5 (Dropout)          (None, 80)                0         
_________________________________________________________________
dense_5 (Dense)              (None, 3)                 243       
_________________________________________________________________
activation_5 (Activation)    (None, 3)                 0         
=================================================================
Total params: 58,483
Trainable params: 58,483
Non-trainable params: 0
_________________________________________________________________
