_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
cu_dnngru_40 (CuDNNGRU)      (None, 100)               60600     
_________________________________________________________________
dropout_40 (Dropout)         (None, 100)               0         
_________________________________________________________________
dense_40 (Dense)             (None, 3)                 303       
_________________________________________________________________
activation_40 (Activation)   (None, 3)                 0         
=================================================================
Total params: 60,903
Trainable params: 60,903
Non-trainable params: 0
_________________________________________________________________
