_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
cu_dnngru_90 (CuDNNGRU)      (None, 120)               79920     
_________________________________________________________________
dropout_90 (Dropout)         (None, 120)               0         
_________________________________________________________________
dense_90 (Dense)             (None, 3)                 363       
_________________________________________________________________
activation_90 (Activation)   (None, 3)                 0         
=================================================================
Total params: 80,283
Trainable params: 80,283
Non-trainable params: 0
_________________________________________________________________
