backend: tensorflow
class_name: Sequential
config:
  layers:
  - class_name: GRU
    config:
      activation: tanh
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, null, 100]
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dropout: 0.0
      dtype: float32
      go_backwards: false
      implementation: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: gru_30
      recurrent_activation: hard_sigmoid
      recurrent_constraint: null
      recurrent_dropout: 0.0
      recurrent_initializer:
        class_name: Orthogonal
        config: {gain: 1.0, seed: null}
      recurrent_regularizer: null
      reset_after: false
      return_sequences: false
      return_state: false
      stateful: false
      trainable: true
      units: 100
      unroll: false
      use_bias: true
  - class_name: Dropout
    config: {name: dropout_32, noise_shape: null, rate: 0.2, seed: null, trainable: true}
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_32
      trainable: true
      units: 3
      use_bias: true
  - class_name: Activation
    config: {activation: softmax, name: activation_32, trainable: true}
  name: sequential_32
keras_version: 2.2.4
