_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
cu_dnngru_5 (CuDNNGRU)       (None, 50)                22800     
_________________________________________________________________
dropout_5 (Dropout)          (None, 50)                0         
_________________________________________________________________
dense_5 (Dense)              (None, 3)                 153       
_________________________________________________________________
activation_5 (Activation)    (None, 3)                 0         
=================================================================
Total params: 22,953
Trainable params: 22,953
Non-trainable params: 0
_________________________________________________________________
