_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
gru_30 (GRU)                 (None, 100)               60300     
_________________________________________________________________
dropout_32 (Dropout)         (None, 100)               0         
_________________________________________________________________
dense_32 (Dense)             (None, 3)                 303       
_________________________________________________________________
activation_32 (Activation)   (None, 3)                 0         
=================================================================
Total params: 60,603
Trainable params: 60,603
Non-trainable params: 0
_________________________________________________________________
