_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
cu_dnnlstm_34 (CuDNNLSTM)    (None, 120)               106560    
_________________________________________________________________
dropout_34 (Dropout)         (None, 120)               0         
_________________________________________________________________
dense_34 (Dense)             (None, 3)                 363       
_________________________________________________________________
activation_34 (Activation)   (None, 3)                 0         
=================================================================
Total params: 106,923
Trainable params: 106,923
Non-trainable params: 0
_________________________________________________________________
