_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
cu_dnngru_23 (CuDNNGRU)      (None, 80)                43680     
_________________________________________________________________
dropout_23 (Dropout)         (None, 80)                0         
_________________________________________________________________
dense_23 (Dense)             (None, 3)                 243       
_________________________________________________________________
activation_23 (Activation)   (None, 3)                 0         
=================================================================
Total params: 43,923
Trainable params: 43,923
Non-trainable params: 0
_________________________________________________________________
